mainconf/Catalogs/Абонементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Абонементы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заморозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЗаморозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

mainconf/Catalogs/Абонементы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура СформироватьНаименование()
	Объект.Наименование = СтрШаблон("%1 (%2)",Объект.Владелец, Объект.Номенклатура);	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	СформироватьНаименование();
	Объект.СрокДействия = ОбщиеФункции.ПолучитьСрокДействияАбонемента(Объект.Номенклатура);
	Объект.ДнейЗаморозки = ОбщиеФункции.ПолучитьДнейЗаморозки(Объект.Номенклатура);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДатуОкончанияАбонемента() 
	НоваяДатаОкончанияАбонемента=0;
	НоваяДатаОкончанияАбонемента = ДобавитьМесяц(Объект.ДатаАктивации,Объект.СрокДействия)+Объект.Заморозки.Итог("ДнейЗаморозки")*86400;
	Объект.ДатаОкончания = НоваяДатаОкончанияАбонемента;
КонецПроцедуры




&НаКлиенте
Процедура ПересчитатьОстатокДнейЗаморозки() 
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктивацииПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
КонецПроцедуры


&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьДниЗаморозки(СтрокаТЧ,Объект.ОстатокДнейЗаморозки);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьДниЗаморозки(СтрокаТЧ,Объект.ОстатокДнейЗаморозки);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры

                  
&НаКлиенте
Процедура ЗаморозкиДнейЗаморозкиПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиПослеУдаления(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры
